In [12]:
import pandas as pd
import numpy as np

import pymysql
pymysql.install_as_MySQLdb()

from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists

# Create connection string using credentials following this format
# connection = "dialect+driver://username:password@host:port/database"
connection_str = "mysql+pymysql://root:Neiu1234@localhost/test_db"

#create engine
engine = create_engine(connection_str)

You can use execute any SQL query with pd.read_sql and your engine. This includes any of the CRUD processes. (Except for the CREATE DATABASE which can be done with the code below.

IMPORTANT NOTE: Your connection_str value must end with the name of the NEW database you want to create. 

In the code above, the new database was named "new_db",  change this to be something more appropriate for the data.

Create a New Database

In [13]:
# Check if the database exists. If not, create it.
if database_exists(connection_str) == False:
  create_database(connection_str)
else:
  print('The database already exists')

The database already exists

To verify that the database was created, check with the following:

In [14]:
database_exists(connection_str)

True

Lets add a pandas dataframe as a table to our test_db.

In [15]:
# Read data in
df = pd.read_csv('Data/Tshirt.csv')
df.head()

  Size  Color  Cost Sold
0    S   Blue  5.00    Y
1    M    Red  7.49    Y
2    M  Green  8.00    N
3   XL  Green  4.00    N
4    L    Red  9.99    Y

In [16]:
# Add dataframe to MySQL. To append instead of replacing use <if_exists = 'replace'>
df.to_sql('tshirts', engine, if_exists = 'replace')

9

In [17]:
# Test a query to make sure things are working.
q = """
SELECT * FROM tshirts LIMIT 5
"""
pd.read_sql(q, engine)

   index Size  Color  Cost Sold
0      0    S   Blue  5.00    Y
1      1    M    Red  7.49    Y
2      2    M  Green  8.00    N
3      3   XL  Green  4.00    N
4      4    L    Red  9.99    Y

In [18]:
# Show the different tables in our database
q = """
SHOW TABLES
"""
pd.read_sql(q, engine)

  Tables_in_test_db
0           tshirts